Revit 2027 API
ParameterTypeId.StairsMinAutomaticLandingDepth Property
 "Minimum Automatic Landing Depth": The minimum depth of automatic landing
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsMinAutomaticLandingDepth { get; }
Public Shared ReadOnly Property StairsMinAutomaticLandingDepth As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsMinAutomaticLandingDepth {
	ForgeTypeId^ get ();
}
static member StairsMinAutomaticLandingDepth : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace